{"1": {"source": "Grist", "url": "https://grist.org/accountability/american-cities-want-to-recycle-their-plastic-trash-in-mexico-critics-call-it-waste-colonialism/", "title": "American cities want to recycle their plastic trash in Mexico. Critics call it ‘waste colonialism.’", "img": "https://grist.org/wp-content/uploads/2023/03/Mexicali-PET-thermoforms.png", "summary": "One of these companies is Direct Pack, whose headquarters are in Azusa, California, just outside Los Angeles.\nPuckett said the Mexicali facility could run afoul of an international agreement called the Basel Convention, which regulates the international plastic waste trade.\nMultiple washes are required to remove sticky glues and labels from PET thermoforms, making them significantly more water-intensive to recycle than bottles.\nJolin said the Mexicali facility would “not use a lot of fresh water” — about 800 gallons per day.\n“Instead of forcing their own companies to make the transition toward reusability, they are sending all their plastic waste to countries where there are more flexible laws,” she said.", "sentiment": "positive"}, "2": {"source": "Yahoo Entertainment", "url": "https://finance.yahoo.com/news/recycle-track-systems-acquires-leading-151500068.html", "title": "Recycle Track Systems acquires leading Canadian waste services provider RecycleSmart Solutions, Inc.", "img": "https://media.zenfs.com/en/cnwgroup.com/20875686bf0045c6ac8b2de2697f76f7", "summary": "Recycle Track Systems, Inc. (“RTS”) has acquired RecycleSmart Solutions, Inc. (“RecycleSmart”), Canada’s largest independent provider of smart waste diversion, organic capture, and recycling management technology now operating as Recycle Track Systems CA.\nAbout Recycle Track Systems, Inc.\nRecycle Track Systems, Inc. combines technology with high-touch service to make waste disposal easier, smarter, and more responsible.\nFrom on-demand removal to fully integrated waste management solutions, RTS helps companies and municipalities easily track and optimize their pickups.\nCisionView original content to download multimedia:https://www.prnewswire.com/news-releases/recycle-track-systems-acquires-leading-canadian-waste-services-provider-recyclesmart-solutions-inc-301786071.htmlSOURCE Recycle Track Systems (RTS)CisionView original content to download multimedia: http://www.newswire.ca/en/releases/archive/March2023/30/c3653.html", "sentiment": "positive"}, "3": {"source": "Yahoo Entertainment", "url": "https://finance.yahoo.com/news/whirlpool-corp-achieves-goal-zero-121500646.html", "title": "Whirlpool Corp. Achieves Goal of Zero Waste to Landfill for Manufacturing Sites Worldwide", "img": "https://media.zenfs.com/en/accesswire.ca/f68e78ecf21d4d0dbc793b960a3b01ce", "summary": "This goal is aligned with the UL ECVP 2799 Zero Waste to Landfill standard, which requires at least 95 percent diversion from landfills.\n\"Our Zero Waste to Landfill achievement is a significant milestone that underscores the commendable dedication and collective commitment from our team to drive meaningful change.\nZero Waste to Landfill is part of Whirlpool Corporation''s ongoing commitment to World Class Manufacturing (WCM), which sets the highest standards for manufacturing excellence and is the foundation for the company's sustainable manufacturing journey.\nTo achieve the Zero Waste to Landfill goal, Whirlpool Corporation has maintained an unwavering commitment to do the right thing for consumers and the planet while not compromising product performance.\nWhirlpool Corporation, Friday, April 7, 2023, Press release pictureView additional multimedia and more ESG storytelling from Whirlpool Corporation on 3blmedia.com.", "sentiment": "positive"}, "4": {"source": "Yahoo Entertainment", "url": "https://finance.yahoo.com/news/barrier-mapping-case-study-ohio-161500193.html", "title": "Barrier Mapping Case Study: The Ohio State University Wexner Medical Center", "img": "https://s.yimg.com/ny/api/res/1.2/tHiXDOUXVSFkArLssiNXSw--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyMDA7aD04MTY-/https://media.zenfs.com/en/accesswire.ca/b4a35e0134336e293ba4c29267a9bdef", "summary": "Space limitations in its facilitiesThis case study explores these barriers in greater detail and outlines the solutions identified by the Ohio State Wexner Medical Center.\nTwo outpatient care locations were chosen for the pilot because they are segregated from the rest of the medical campus, allowing for an isolated pilot program.\nThrough the advanced recycling pilot project, approximately 550 pounds of healthcare plastics are collected weekly from the two ambulatory locations.\nStory continuesView additional multimedia and more ESG storytelling from Healthcare Plastics Recycling Council on 3blmedia.com.\nContact Info:Spokesperson: Healthcare Plastics Recycling CouncilWebsite: https://www.3blmedia.com/profiles/healthcare-plastics-recycling-councilEmail: info@3blmedia.comSOURCE: Healthcare Plastics Recycling CouncilView source version on accesswire.com:https://www.accesswire.com/750186/Barrier-Mapping-Case-Study-The-Ohio-State-University-Wexner-Medical-Center", "sentiment": "positive"}, "5": {"source": "Yahoo Entertainment", "url": "https://finance.yahoo.com/news/high-tide-celebrates-earth-day-180000143.html", "title": "High Tide Celebrates Earth Day With Announcement of Contribution Towards Recycling Over 20,000 Pounds of Plastic Waste Through Partnership With [Re] Waste", "img": "https://media.zenfs.com/en/cnwgroup.com/7480ec6fe7a02a0895dc7db85f4c032b", "summary": "Through this initiative, both Alberta-based companies High Tide and [Re] Waste are making an impact across the nation for greater environmental sustainability.\nE-commerce Platforms: High Tide operates a suite of leading accessory sites across the world, including Grasscity.com, Smokecartel.com, Dailyhighclub.com, and Dankstop.com.\nCBD: High Tide continues to cultivate the possibilities of consumer CBD through Nuleafnaturals.com, FABCBD.com, blessedcbd.de and blessedcbd.co.uk.\nFor investment performance, don't miss the High Tide profile pages on SEDAR and EDGAR.\nCisionView original content to download multimedia:https://www.prnewswire.com/news-releases/high-tide-celebrates-earth-day-with-announcement-of-contribution-towards-recycling-over-20-000-pounds-of-plastic-waste-through-partnership-with-re-waste-301804397.htmlSOURCE High Tide Inc.CisionView original content to download multimedia: http://www.newswire.ca/en/releases/archive/April2023/21/c2317.html", "sentiment": "positive"}, "6": {"source": "Nature.com", "url": "https://www.nature.com/articles/s41599-023-01617-x", "title": "Technology of water in ancient Iran from prehistory to the Islamic Golden Age", "img": "https://media.springernature.com/m685/springer-static/image/art%3A10.1057%2Fs41599-023-01617-x/MediaObjects/41599_2023_1617_Fig1_HTML.png", "summary": "There is a general rule for settlement development; the more access to perennial water resources, the greater the potential for settlement development.\nThe department’s duties were developing, managing, and protecting water resources, collecting water tax and tribute from all the territories, constituting rules, and solving water-related conflicts.\nDuring this period, water management was well-organized and coherent at all levels, administratively and operationally.\nThe extreme level of government authority over water resources necessitated the establishment of an absolute tyranny over the majority of society.\nThe Sassanids, in turn, developed their water resources in accordance with state/district and local norms for owning, managing, sharing, and preserving water resources.", "sentiment": "positive"}, "7": {"source": "TMZ", "url": "https://www.tmz.com/2023/04/25/latto-loaded-gun-case-dismissed-diversion-program/", "title": "Latto's Loaded Gun Case Dismissed, Completed Diversion Program", "img": "https://imagez.tmz.com/image/ce/16by9/2023/04/25/cea33bb696b54dd9b16251076962fb90_xl.jpg", "summary": "Latto's reached the finish line in her airport loaded gun case ... because we're told it's been dismissed, now that she's met all requirements of a year-long program to clear the charges.\nAccording to the L.A. County Superior Court Clerk, the rapper's case was officially dismissed Tuesday -- per her diversion program, Latto completed a gun & safety course, 120 hours of community service, and avoided all firearms to get it done.\nAs you'll recall, Latto fans first discovered the ordeal when she rapped about it in Mello Buckzz's track, \"Boom Pt.\nShe started her 12-month diversion program in April of last year.\nBTW ... Latto filled the details in for fans, saying she had a loaded Glock in her purse while trying to get on a private flight to ATL.", "sentiment": "positive"}, "8": {"source": "Yahoo Entertainment", "url": "https://finance.yahoo.com/news/stericycle-joins-2023-drug-takeback-141000437.html", "title": "Stericycle Joins the 2023 Drug Takeback Day Call-to-Action", "img": "https://media.zenfs.com/en/prnewswire.com/5fc56715842146770bab5c1abd70f1e4", "summary": "\"Local businesses and the general public can help combat drug diversion to take back their communities and keep them safe and healthy.\"\nMedication Collection Kiosks: These secure medication collection kiosks are placed in public DEA-registered locations within a community, such as retail or hospital pharmacies.\nStericycle is committed to delivering practical and user-friendly solutions that streamline the medication disposal process for consumers.\nFor more information on the options we offer for post-consumer pharmaceutical waste disposal, visit the Stericycle website.\nStericycle serves customers in the U.S. and 16 countries with solutions for regulated waste and compliance services and secure information destruction.", "sentiment": "positive"}, "9": {"source": "Al Jazeera English", "url": "https://www.aljazeera.com/gallery/2023/4/11/history-illustrated-the-war-on-al-aqsa", "title": "History Illustrated: The war on Al-Aqsa", "img": "https://www.aljazeera.com/wp-content/uploads/2023/04/01.jpg?resize=1920%2C1440", "summary": "History Illustrated is a weekly series of insightful perspectives that puts news events and current affairs into an historical context using graphics generated with artificial intelligence.", "sentiment": "positive"}, "10": {"source": "Yahoo Entertainment", "url": "https://finance.yahoo.com/news/sealed-air-global-impact-report-133000060.html", "title": "Sealed Air Global Impact Report: Reducing Energy Consumption", "img": "https://s.yimg.com/ny/api/res/1.2/9VnQs8bKroiDn7hj07bOBw--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyMDA7aD02NzQ-/https://media.zenfs.com/en/accesswire.ca/08d752031447210d3bb76f8176453311", "summary": "Originally published in Sealed Air's Global Impact ReportNORTHAMPTON, MA / ACCESSWIRE / April 11, 2023 / Sealed Air (SEE) is implementing measures to increase energy efficiency and implementation of renewable energy sources across its value chain.\nThe goal is to achieve energy intensity reductions of 17% by 2025 and 28% by 2030 from a 2019 base year.\n*To normalize foreign exchange rates, net trade sales are adjusted to 2019 foreign exchange rates, except for one currency which has been designated as highly inflationary under U.S. GAAP and uses 2021 foreign exchange rates.\n*To normalize foreign exchange rates, net trade sales are adjusted to 2019 foreign exchange rates, except for one currency which has been designated as highly inflationary under U.S. GAAP and continues to utilize 2021 foreign exchange rates.\nSealed Air, Tuesday, April 11, 2023, Press release pictureView additional multimedia and more ESG storytelling from Sealed Air on 3blmedia.com.", "sentiment": "positive"}, "11": {"source": "Hospitality Net", "url": "https://www.hospitalitynet.org/news/4116073.html", "title": "KSL Resorts Unveils New Sustainability Program", "img": "https://www.hospitalitynet.org/picture/social_153155181.jpg?t=1682409746", "summary": "KSL Resorts announced today it has launched a new sustainability program – “On Purpose” – to be rolled out amongst its portfolio of 11 world class destination hotels and resorts, among them Camelback Resort (Pocono Mountains, PA); Vespera Resort on Pismo Beach, CA; Fairmont Grand Del Mar (San Diego, CA); Silverado Resort and Spa (Napa, CA); and Sheraton San Diego Hotel & Marina.\nSingle Use Materials – the goal is to eliminate all single use materials at participating resorts by the end of 2023.\n– the goal is to eliminate all single use materials at participating resorts by the end of 2023.\nAdditionally, said Pullan, each KSL Resorts property will form – or has formed – an onsite sustainability committee and will identify a suitable local nature conservation partner.\nAsset managed properties include Fairmont Grand Del Mar (San Diego, CA); Renaissance Esmeralda Resort & Spa (Indian Wells, CA); Marram (Montauk, NY); and Outrigger Hotels and Resorts (Hawaii and worldwide).", "sentiment": "positive"}, "12": {"source": "Yahoo Entertainment", "url": "https://finance.yahoo.com/news/clean-vision-completes-acquisition-establish-140000558.html", "title": "Clean Vision Completes Acquisition to Establish \"Clean-Seas Morocco\" And Begin Rapid Capacity Expansion", "img": "https://media.zenfs.com/en/accesswire.ca/1b3c4136396d7483082b81118155c253", "summary": "Following the completion of this transaction, Ecosynergie Group has been renamed Clean-Seas Morocco, LLC (\"Clean-Seas Morocco\").\n\"We are thrilled to have completed our acquisition of a majority interest in Ecosynergie Group,\" said Clean Vision Chief Revenue Officer, Daniel Harris.\nWe look forward to working with Clean-Seas to establish Clean-Seas Morocco as the PCN hub in North Africa.\"\nAbout Clean Vision CorporationClean Vision Corporation operates and intends to acquire and operate a portfolio of synergistic companies in the sustainable clean technology and green energy sectors.\nClean Vision Corporation, Tuesday, April 25, 2023, Press release pictureAbout Clean-Seas, Inc.Clean-Seas is a wholly owned subsidiary of Clean Vision.", "sentiment": "positive"}, "13": {"source": "The Guardian", "url": "https://www.theguardian.com/uk-news/2023/apr/27/britain-leaving-echr-would-be-catastrophic-says-development-minister", "title": "Britain leaving ECHR would be ‘catastrophic’, says development minister", "img": "https://i.guim.co.uk/img/media/a83e2055e29912e98c0a33e420f880a996e39f1a/0_114_5269_3162/master/5269.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=9a0d7829d6d217afd44ff43a46d24ba7", "summary": "The UK’s departure from the European convention on human rights would be catastrophic and is extremely unlikely, the development minister, Andrew Mitchell, has said as he launched plans designed to show that the UK is back as a global leader on development.\nSpeaking at Chatham House, Mitchell said: “I don’t think there’s any question of Britain leaving the ECHR, the prime minister I think has made that pretty clear.”He said he accepted that the UK was willing to test the limits of what was possible under the ECHR, but added: “I think that leaving the ECHR is incredibly unlikely to happen.\nafter newsletter promotionBritain’s development leadership “had been sorely missed across the world”, he admitted.\nCurrently, only half of Britons support UK aid spending, but his objective is to make this rise to 70% within 10 years, as measured by a development engagement lab run by the University of London.\nHe said that for the moment he had to “suck it up” but he was trying to make sure this diversion of aid spending was temporary.", "sentiment": "positive"}, "14": {"source": "The Guardian", "url": "https://www.theguardian.com/football/2023/apr/12/irreplaceable-sam-kerr-leaves-her-mark-on-england-in-stunning-matildas-win", "title": "Irreplaceable Sam Kerr leaves her mark on England in stunning Matildas win | Sophie Downey", "img": "https://i.guim.co.uk/img/media/4c37dca5c9db6cbfc77a5ef216719c86b812e5da/0_292_3742_2245/master/3742.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=55fb7750cc1b8416a294ff6a8596fc72", "summary": "On top of all of that, however, one of the main points shining through in west London was the need for the Matildas to protect Sam Kerr at all costs.\nThe Matildas’ talisman, with all of her attacking guile and energy, is Australia’s not-so-secret weapon.\nSix players under 25 lined up against Scotland, five against England with Clare Hunt continuing the start of her Matildas career with another strong showing at centre-back.\nBeing partnered with the wisdom of Clare Polkinghorne in defence will have given the Matildas’ newest player plenty of confidence going forward.\nThey rarely gave England an inch to work in, pressing with intent and disrupting the flow of the hosts’ attack.", "sentiment": "positive"}, "15": {"source": "Yahoo Entertainment", "url": "https://finance.yahoo.com/news/melco-announces-release-company-2022-080600760.html", "title": "Melco announces release of company’s 2022 sustainability report Rise to go Above & Beyond", "img": "https://media.zenfs.com/en/globenewswire.com/505037f6b1606b2f05355e48fe0dc19a", "summary": "Melco Resorts & Entertainment LimitedMACAU, April 28, 2023 (GLOBE NEWSWIRE) -- Melco Resorts & Entertainment has published its fifth sustainability strategy for the year 2022 ‘RISE to go Above & Beyond’ (link).\nMr. Lawrence Ho, Chairman and CEO of Melco Resorts and Entertainment, said, “Action with positive engagement has been key to our approach to sustainability.\nOur latest sustainability strategy is testament to an integrated resort business operating to the highest standards and for the long term.\nThe Company currently operates Altira Macau (www.altiramacau.com), an integrated resort located at Taipa, Macau and City of Dreams (www.cityofdreamsmacau.com), an integrated resort located in Cotai, Macau.\nThe Company also majority owns and operates Studio City (www.studiocity-macau.com), a cinematically-themed integrated resort in Cotai, Macau.", "sentiment": "positive"}, "16": {"source": "Yahoo Entertainment", "url": "https://finance.yahoo.com/news/socalgas-climate-champions-grant-awards-105000591.html", "title": "SoCalGas' Climate Champions Grant Awards Additional $200,000 to Recipients to Further Climate Solutions", "img": "https://media.zenfs.com/en/prnewswire.com/8db35baf331ed1dea79619980e8de29e", "summary": "\"SoCalGas' Climate Champions Grant will advance many of the great local projects and research taking place in southern and central California.\nOver the last two years, the SoCal Climate Champions Grant has awarded $600,000 in grants to support nonprofit organizations.\nFor more information visit socalgas.com/newsroom or connect with SoCalGas on Twitter (@SoCalGas), Instagram (@SoCalGas) and Facebook.\nSempra Infrastructure, Sempra Infrastructure Partners, Sempra Texas, Sempra Texas Utilities, Oncor Electric Delivery Company LLC (Oncor) and Infraestructura Energética Nova, S.A.P.I.\nSoCalGas Logo (PRNewsfoto/San Diego Gas & Electric,Southern California Gas Company)CisionView original content to download multimedia:https://www.prnewswire.com/news-releases/socalgas-climate-champions-grant-awards-additional-200-000-to-recipients-to-further-climate-solutions-301804439.htmlSOURCE Southern California Gas Company", "sentiment": "positive"}, "17": {"source": "The Guardian", "url": "https://www.theguardian.com/commentisfree/2023/apr/17/british-pub-right-golliwogs-rightwing-politicians-press-racism-people-colour", "title": "Is a British pub racist for displaying golliwogs? Think how that question makes people of colour like me feel | Nesrine Malik", "img": "https://i.guim.co.uk/img/media/836fd6e88c5352358484e5363fdc38a9b615787a/0_429_7373_4426/master/7373.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctb3BpbmlvbnMucG5n&enable=upscale&s=a2f8621e835cb44965d722e6e5f7a811", "summary": "It’s the smile, I think, its teeth frozen in a rictus grin behind the exaggerated redness of the lips.\nThe golliwog, despite it being a relic of the past, is in fact a symbol of the present.\nNeither of these incidents suggest that Britain is a uniformly racist place, but clearly, I think it’s safe to say, something is going on.\nYou might think we also agreed that we couldn’t say white people should own black slaves, but it seems that even that is not a certainty.\nThe home secretary, Suella Braverman, apparently found time to let it be known that she had rebuked the police for getting involved in the golliwog matter.", "sentiment": "positive"}, "18": {"source": "Marketscreener.com", "url": "https://www.marketscreener.com/quote/stock/BRUNSWICK-CORPORATION-11779/news/Brunswick-12-Brunswick-zero-waste-facilities-diverted-9-million-pounds-of-waste-in-2022-additiona-43384762/?utm_medium=RSS&utm_content=20230330", "title": "Brunswick : 12 Brunswick zero-waste facilities diverted 9 million pounds of waste in 2022; additional facilities will reach zero-waste status in 2023", "img": "https://www.marketscreener.com/images/twitter_MS_fdnoir.png", "summary": "METTAWA, Ill. - March 30, 2023 - In honor of United Nations' first International Day of Zero-Waste, Brunswick Corporation is highlighting efforts to transition and maintain zero-waste-to-landfill status for its locations over the last year.\nBrunswick currently has 12 zero-waste-to-landfill locations that diverted an estimated 9 million pounds of waste in 2022, with additional locations on track to obtain the designation in 2023.\n\"We are proud of our employees and their commitment to achieving these zero-waste milestones,\" said Jennifer Koenig, Brunswick Chief Sustainability Officer.\nTo learn more about Brunswick sustainability efforts, visit https://www.brunswick.com/corporate-responsibility.\nIn the category of Marine Propulsion, these brands include Mercury Marine, Mercury Racing and MerCruiser.", "sentiment": "positive"}, "19": {"source": "Yahoo Entertainment", "url": "https://finance.yahoo.com/news/principal-r-announces-five-extension-182000240.html", "title": "Principal(R) Announces Five-Year Extension Agreement for Principal Charity Classic", "img": "https://media.zenfs.com/en/accesswire.ca/e4f6ffc050ba059548a4abf78453ba1b", "summary": "Last year, the Principal Charity Classic raised more than $8.2 million, surpassing the previous record of $7.3 million set in 2021.\nAbout the Principal Charity ClassicThe Principal Charity Classic is an annual and award-winning PGA TOUR Champions event dedicated to investing in the future of Iowa kids.\nIn 2022, the Principal Charity Classic raised a record $8.2 million for charity, bringing the tournament's giving total to more than $45.6 million since 2007.\n©2023 Principal Financial Services, Inc.2814873-032023Principal Financial Group, Wednesday, March 29, 2023, Press release pictureView additional multimedia and more ESG storytelling from Principal Financial Group on 3blmedia.com.\nContact Info:Spokesperson: Principal Financial GroupWebsite: https://www.3blmedia.com/profiles/principal-financial-groupEmail: info@3blmedia.comSOURCE: Principal Financial GroupView source version on accesswire.com:https://www.accesswire.com/746521/PrincipalR-Announces-Five-Year-Extension-Agreement-for-Principal-Charity-Classic", "sentiment": "positive"}, "20": {"source": "Yahoo Entertainment", "url": "https://finance.yahoo.com/news/ralphs-cardinal-health-disposerx-host-140100680.html", "title": "Ralphs, Cardinal Health, and DisposeRx® to Host Drug Take Back Event on Saturday, April 22, 2023 in Southern California", "img": "https://media.zenfs.com/en/prnewswire.com/f49cc1b672aafff38ba7d25c83b8e3be", "summary": "\"At Cardinal Health, we're dedicated to building safe and healthy communities nationwide,\" said Jessie Cannon, vice president of Community Relations for Cardinal Health.\n\"We are proud to continue our work with Kroger Health, to support their prevention efforts and build collaborations throughout the country promoting family safety.\"\nRalphs/Kroger Health, in collaboration with Cardinal Health, has hosted drug take back events across the U.S. since 2018.\nTo view the complete list of Kroger Health Drug Take Back event locations across the country, visit https://www.kroger.com/health/pharmacy/prescriptions/takeback .\nWith 50years in business, operations in more than 35 countries and approximately 44,000 employees globally, Cardinal Health is essential to care.", "sentiment": "positive"}, "21": {"source": "Yahoo Entertainment", "url": "https://finance.yahoo.com/news/tillamook-county-creamery-association-shares-142600568.html", "title": "TILLAMOOK COUNTY CREAMERY ASSOCIATION SHARES CLIMATE ACTION PLAN UPDATES", "img": "https://media.zenfs.com/en/prnewswire.com/540956f998a918005b11f2825e18e8e7", "summary": "The TCCA Climate Action Plan aligns with the Innovation for U.S.\nTillamook County Creamery Association (TCCA), a Certified B Corporation,™ provides its Climate Action Plan progress and other stewardship commitment updates in its newly released 2022 Stewardship Report.\nAdditional information about the TCCA Climate Action Plan and goals is also available at Tillamook Climate.\nTillamook County Creamery Association (TCCA), a Certified B Corporation,™ provides its Climate Action Plan progress and other stewardship commitment updates in its newly released 2022 Stewardship Report.\nTillamook County Creamery Association (PRNewsfoto/Tillamook County Creamery Assoc)CisionView original content to download multimedia:https://www.prnewswire.com/news-releases/tillamook-county-creamery-association-shares-climate-action-plan-updates-301796893.htmlSOURCE Tillamook County Creamery Association", "sentiment": "positive"}}